FutureDesigns/uEZ/uEZ/Source/Devices/USBDevice/NXP/LPC1788/LPC1788_USBDevice.c
/*-------------------------------------------------------------------------*
 * Function:  INXP_LPC1788_StandardControlTransfer
 *-------------------------------------------------------------------------*
 * Description:
 *      USB Endpoint 0 "Control" has a packet request.  See if it is
 *      a standard control or pass it on to the next level.
 * Inputs:
 *      void *aWorkspace                    -- Workspace
 *      TUInt8 aEndpoint          -- Endpoint 0 (in or out)
 *      T_USBEndpointStatus aStatus -- Status of the endpoint request
 *-------------------------------------------------------------------------*/
static void INXP_LPC1788_StandardControlTransfer(
        void *aWorkspace,
        TUInt8 aEndpoint,
        T_USBEndpointStatus aStatus)
{
    int numRead;
    TUInt8 setupType;
    T_USBDevice_LPC1788_Workspace *p =
        (T_USBDevice_LPC1788_Workspace *)aWorkspace;

dprintf("{SC %d}", aEndpoint);
    // Is this device receiving a request from the host to send it data?
    if (aEndpoint == ENDPOINT_OUT(0)) {
        // Is the packet a setup packet?
        if (aStatus & USB_ENDPOINT_SELECT_SETUP_BIT) {
            // Reset the setup packet and put into memory
            ((*p->iUSBDeviceController)->Read)(
                p->iUSBDeviceController,
                0,
                (TUInt8 *)&p->iSetupPacket,
                sizeof(T_USBSetupPacket));
dprintf("[Setup $%02X $%02X %d %d %d]", p->iSetupPacket.iRequestType, p->iSetupPacket.iRequest, p->iSetupPacket.iValue, p->iSetupPacket.iIndex, p->iSetupPacket.iLength);

            // defaults for data pointer and residue
            setupType = p->iSetupPacket.iRequestType.iRecipientType;
            p->iPacketData = p->iUSBDevice.iRequestTypeHandlers[setupType].iBuffer;
            p->iPacketRemaining = p->iSetupPacket.iLength;
            p->iPacketLength = p->iSetupPacket.iLength;
dprintf("[Len %d]", p->iPacketLength);

            // Is this a zero length packet or a request from the host
            // to get something?
//            if ((p->iSetupPacket.iLength == 0) ||
//                    (p->iSetupPacket.iRequestType.iDirection ==
//                        USB_DIRECTION_TO_HOST)) {
//dprintf("[Zero]");
                if (p->iSetupPacket.iRequestType.iDirection !=
                        USB_DIRECTION_TO_HOST) {
                    ((*p->iUSBDeviceController)->Write)(
                            p->iUSBDeviceController,
                            ENDPOINT_IN(0),
                            0,
                            0);

                }

                // Call the appropriate function
                if (!ICallSetupHandler(
                        p,
                        &p->iSetupPacket,
                        &p->iPacketLength,
                        &p->iPacketData)) {
                    // For some reason, the packet could not be
                    // handled.  Stall the control pipe.
                    ((*p->iUSBDeviceController)->SetStallState)(
                            p->iUSBDeviceController,
                            aStatus,
                            ETrue);
                    return;
                } else {
                    // The remaining bytes are equal to the current length,
                    // trimmed to the amount requested by the host.
                    p->iPacketRemaining = p->iPacketLength;
                    if (p->iPacketRemaining > p->iSetupPacket.iLength)
                        p->iPacketRemaining = p->iSetupPacket.iLength;

                    // Send the start of the response
                    IUSBCreateDataInPacket(p);
                }
//            } else {
//dprintf("[NZ]");
//            }
        } else {
dprintf("[Data %d]", p->iPacketRemaining);
            // Is not a setup packet.  We are transferring data.
            // Are we expecting any more data?
            if (p->iPacketRemaining > 0) {
dprintf("[Remains]");
                // Read in the data and store
                numRead = ((*p->iUSBDeviceController)->Read)(
                                p->iUSBDeviceController,
                                0x00,
                                p->iPacketData,
                                p->iPacketRemaining);

                // Did we have a problem reading the data?
                if (numRead < 0)  {
                    // Just stall the data and stop here
                    ((*p->iUSBDeviceController)->SetStallState)(
                            p->iUSBDeviceController,
                            aStatus,
                            ETrue);
                    return;
                }

                // Next data location and subtract amount read
                p->iPacketData += numRead;
                p->iPacketRemaining -= numRead;

                // Any more data left to read?
                if (p->iPacketRemaining == 0) {
dprintf("[All]");
                    // All data has been read.
                    setupType = p->iSetupPacket.iRequestType.iRecipientType;
                    p->iPacketData = p->iUSBDevice.iRequestTypeHandlers[setupType].iBuffer;
                    // Now that all the data has been received from the
                    // the bus and hardware, process the data packet.
                    if (!ICallSetupHandler(
                                p,
                                &p->iSetupPacket,
                                &p->iPacketLength,
                                &p->iPacketData)) {
                        // For some reason, the packet could not be
                        // handled.  Stall the control pipe.
                        ((*p->iUSBDeviceController)->SetStallState)(
                            p->iUSBDeviceController,
                            aStatus,
                            ETrue);
                        return;
                    }
                    p->iPacketRemaining = p->iPacketLength;

                    // Tell host we got the data
                    IUSBCreateDataInPacket(p);
                }
            } else {
dprintf("[Clear]");
                // Do a read to clear the remaining data if we are
                // not expecting more data.
                ((*p->iUSBDeviceController)->Read)(
                    p->iUSBDeviceController,
                    0,
                    0,
                    0);
            }
        }
    } else if (aEndpoint == ENDPOINT_IN(0)) {
dprintf("[In]");
        // IN transfer
        // send more data if available (possibly a 0-length packet)
        if (p->iSetupPacket.iRequestType.iDirection == USB_DIRECTION_TO_HOST) {
dprintf("[2Host]");
            IUSBCreateDataInPacket(p);
        } else {
dprintf("[2Dev]");
            if (p->iNeedSetAddress) {
dprintf("[NeedAddr]");
                p->iNeedSetAddress = EFalse;
                (*p->iUSBDeviceController)->SetAddress(
                        p->iUSBDeviceController,
                        p->iUSBAddress);
            }
        }
    } else {
//        ASSERT(EFalse);
    }
}

/*---------------------------------------------------------------------------*
 * Routine:  INXP_LPC1788_USBDevice_EndpointReady
 *---------------------------------------------------------------------------*
 * Description:
 *      Endpoint is ready.  Release the semaphore holding back requests
 *      to handle endpoint data.  ProcessEndpoints should be called soon.
 *      NOTE: This routine is a callback called during an interrupt.
 * Inputs:
 *      void *aWorkspace                    -- Workspace
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
static void INXP_LPC1788_USBDevice_EndpointReady(void *aCallbackWorkspace)
{
    T_USBDevice_LPC1788_Workspace *p =
        (T_USBDevice_LPC1788_Workspace *)aCallbackWorkspace;

    // Let the main monitor task resume
    _isr_UEZSemaphoreRelease(p->iReady);
}

/*---------------------------------------------------------------------------*
 * Routine:  NXP_LPC1788_USBDevice_ProcessEndpoints
 *---------------------------------------------------------------------------*
 * Description:
 *      Wait for USBDevice endpoints to become available and process
 *      if ready.
 * Inputs:
 *      void *aWorkspace                  -- Workspace
 *      TUInt32 aTimeout                  -- Timeout to wait for endpoint
 *                                          processing ready.
 * Outputs:
 *      T_uezError                   -- Error code
 *---------------------------------------------------------------------------*/
static T_uezError NXP_LPC1788_USBDevice_ProcessEndpoints(
        void *aWorkspace,
        TUInt32 aTimeout)
{
    T_uezError error = UEZ_ERROR_NONE;
    T_USBDevice_LPC1788_Workspace *p = (T_USBDevice_LPC1788_Workspace *)aWorkspace;

