FutureDesigns/uEZ/uEZ/Source/Devices/USBDevice/NXP/LPC1788/LPC1788_USBDevice.c
/*-------------------------------------------------------------------------*
 * Function:  NXP_LPC1788_USBDevice_RegisterRequestTypeCallback
 *-------------------------------------------------------------------------*
 * Description:
 *      Register a handler for different types of control 0 requests.
 * Inputs:
 *      void *aWorkspace        -- USB Device's workspace
 *      TUInt8 aType            -- Type of control 0 request.  Can be
 *                                  USB_REQUEST_TYPE_STANDARD,
 *                                  USB_REQUEST_TYPE_CLASS,
 *                                  USB_REQUEST_TYPE_VENDOR, or
 *                                  USB_REQUEST_TYPE_RESERVED
 *      void *aBuffer           -- Buffer to receive data (up to endpoint
 *                                  max sized packet).
 *      void *aCallbackWorkspace -- Pointer to callback's workspace
 *      T_USBRrequestHandlerFunc aRequestHandler -- Function called when
 *                                  control endpoint 0 receives data
 *                                  of this type.
 * Outputs:
 *      T_uezError              -- Returns UEZ_ERROR_NONE if successfully
 *                                  registered.  Returns
 *                                  UEZ_ERROR_NOT_AVAILABLE if slot already
 *                                  registered.  Returns
 *                                  UEZ_ERROR_ILLEGAL_OPERATION if incorrect
 *                                  type.
 *-------------------------------------------------------------------------*/
static T_uezError NXP_LPC1788_USBDevice_RegisterRequestTypeCallback(
            void *aWorkspace,
            TUInt8 aType,
            void *aBuffer,
            void *aCallbackWorkspace,
            T_USBRequestHandlerFunc aRequestHandler)
{
    T_uezError error = UEZ_ERROR_NONE;
    T_USBDevice_LPC1788_Workspace *p =
        (T_USBDevice_LPC1788_Workspace *)aWorkspace;
    T_USBDeviceRequestTypeHandlerStruct *p_handler;

    // Modify the callback table while no callbacks can occur
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);

    if (aType <= USB_REQUEST_TYPE_RESERVED) {
        p_handler = &p->iUSBDevice.iRequestTypeHandlers[aType];
        if ((p_handler->iHandler == 0) ||
                ((p_handler->iHandler == NXP_LPC1788_USBDevice_StandardDeviceRequest) &&
                    (aType == USB_REQUEST_TYPE_STANDARD)))  {
            p_handler->iHandler = aRequestHandler;
            p_handler->iBuffer = aBuffer;
            p_handler->iWorkspace = aCallbackWorkspace;
        } else {
            error = UEZ_ERROR_NOT_AVAILABLE;
        }
    } else {
        error = UEZ_ERROR_ILLEGAL_OPERATION;
    }

    UEZSemaphoreRelease(p->iSem);
    return error;
}

/*-------------------------------------------------------------------------*
 * Function:  NXP_LPC1788_USBDevice_UnregisterRequestTypeCallback
 *-------------------------------------------------------------------------*
 * Description:
 *      Register a handler for different types of control 0 requests.
 * Inputs:
 *      void *aWorkspace        -- USB Device's workspace
 *      TUInt8 aType            -- Type of control 0 request.  Can be
 *                                  USB_REQUEST_TYPE_STANDARD,
 *                                  USB_REQUEST_TYPE_CLASS,
 *                                  USB_REQUEST_TYPE_VENDOR, or
 *                                  USB_REQUEST_TYPE_RESERVED
 * Outputs:
 *      T_uezError              -- Returns UEZ_ERROR_NONE if successfully
 *                                  unregistered.  Returns
 *                                  UEZ_ERROR_NOT_FOUND if slot already
 *                                  unregistered.  Returns
 *                                  UEZ_ERROR_ILLEGAL_OPERATION if incorrect
 *                                  type.
 *-------------------------------------------------------------------------*/
static T_uezError NXP_LPC1788_USBDevice_UnregisterRequestTypeCallback(
            void *aWorkspace,
            TUInt8 aType)
{
    T_uezError error = UEZ_ERROR_NONE;
    T_USBDevice_LPC1788_Workspace *p =
        (T_USBDevice_LPC1788_Workspace *)aWorkspace;
    T_USBDeviceRequestTypeHandlerStruct *p_handler;

    // Modify the callback table while no callbacks can occur
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);

    if (aType <= USB_REQUEST_TYPE_RESERVED) {
        p_handler = &p->iUSBDevice.iRequestTypeHandlers[aType];
        if ((p_handler->iHandler == 0) ||
                ((p_handler->iHandler == NXP_LPC1788_USBDevice_StandardDeviceRequest) &&
                    (aType == USB_REQUEST_TYPE_STANDARD)))  {
            // Already unregistered
            error = UEZ_ERROR_NOT_FOUND;
        } else {
            // Unregister the function
            if (aType == USB_REQUEST_TYPE_STANDARD)
                p_handler->iHandler = NXP_LPC1788_USBDevice_StandardDeviceRequest;
            else
                p_handler->iHandler = 0;
            p_handler->iBuffer = 0;
            p_handler->iWorkspace = 0;
        }
    } else {
        error = UEZ_ERROR_ILLEGAL_OPERATION;
    }

    UEZSemaphoreRelease(p->iSem);
    return error;
}

/*-------------------------------------------------------------------------*
 * Function:  NXP_LPC1788_USBDevice_InterruptNakEnable
 *-------------------------------------------------------------------------*
 * Description:
 *      Declare which type of Naks generate interrupts.
 * Inputs:
 *      T_LPC1788_USBDev_Workspace *p -- workspace
 *      TUInt8 aNakBits             -- Nak bits
 *-------------------------------------------------------------------------*/
static void NXP_LPC1788_USBDevice_InterruptNakEnable(
                void *aWorkspace,
                TUInt8 aNakBits)
{
    T_USBDevice_LPC1788_Workspace *p =
        (T_USBDevice_LPC1788_Workspace *)aWorkspace;
    UEZSemaphoreGrab(p->iSem, UEZ_TIMEOUT_INFINITE);
    (*p->iUSBDeviceController)->InterruptNakEnable(
            p->iUSBDeviceController,
            aNakBits);
    UEZSemaphoreRelease(p->iSem);
}

void USBDevice_LPC1788_Create(const char *aName, const char *aHALName)
{
    T_USBDevice_LPC1788_Workspace *p;

    // Register USBDevice (which links it to the USBDeviceController)
    UEZDeviceTableRegister(
            aName,
            (T_uezDeviceInterface *)&USBDevice_NXP_LPC1788_Interface,
            0,
            (T_uezDeviceWorkspace **)&p);

