FutureDesigns/uEZ/uEZ/Source/Devices/USBDevice/NXP/LPC1788/LPC1788_USBDevice.c
    // Access the USBDevice HAL and link to this device
    HALInterfaceFind(
            aHALName,
            (T_halWorkspace **)&p->iUSBDeviceController);
}

/*---------------------------------------------------------------------------*
 * Device Interface table:
 *---------------------------------------------------------------------------*/
const DEVICE_USB_DEVICE USBDevice_NXP_LPC1788_Interface = {
	{
	    // Common device interface
	    "USBDevice:NXP:LPC1788",
	    0x0100,
	    USBDevice_NXP_InitializeWorkspace_USBDevice,
	    sizeof(T_USBDevice_LPC1788_Workspace),
	},
	
    // Functions
    NXP_LPC1788_USBDevice_Configure,
    NXP_LPC1788_USBDevice_Initialize,
    NXP_LPC1788_USBDevice_Connect,
    NXP_LPC1788_USBDevice_Disconnect,
    NXP_LPC1788_USBDevice_SetAddress,
    NXP_LPC1788_USBDevice_EndpointConfigure,
    NXP_LPC1788_USBDevice_Read,
    NXP_LPC1788_USBDevice_Write,
    NXP_LPC1788_USBDevice_SetStallState,
    NXP_LPC1788_USBDevice_IsStalled,
    NXP_LPC1788_USBDevice_EndpointInterruptsEnable,
    NXP_LPC1788_USBDevice_EndpointInterruptsDisable,
    NXP_LPC1788_USBDevice_ForceAddressAndConfiguration,
    NXP_LPC1788_USBDevice_RegisterEndpointCallback,
    NXP_LPC1788_USBDevice_UnregisterEndpointCallback,
    NXP_LPC1788_USBDevice_RegisterRequestTypeCallback,
    NXP_LPC1788_USBDevice_UnregisterRequestTypeCallback,
    NXP_LPC1788_USBDevice_ProcessEndpoints,
    NXP_LPC1788_USBDevice_InterruptNakEnable,
} ;

/*-------------------------------------------------------------------------*
 * End of File:  lpc1788_USBDevice.c
 *-------------------------------------------------------------------------*/
